# ShowGridLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ShowGridLines Property
ScheduleDefinition Class See Also
---
Indicates if the schedule grid lines will be visible on a sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public bool ShowGridLines { get; set; }
```

Visual Basic
---
```text
Public Property ShowGridLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGridLines {
	bool get ();
	void set (bool value);
}
```

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace